{
  "keys":{
    "personality_insights":{
      "username":"50c08a95-83da-4c9d-b97b-f8c7039f2b4c",
      "password":"5fBIFxYcmLus"
    },
    "google_translate":"AIzaSyBOrs89E0o-rCsD0_5JIgosfO6EFmUVd54",
    "visual_recognition":"c4c32f96551234ede15fa5240024b0b66883a52d"
  },
  "movies": {
    "secret_life_of_pet": {
      "name": "The Secret Life of Pets",
      "link": "http://www.imdb.com/title/tt2709768/",
      "content":"The film opens in New York City, where a little dog named Max (voice of Louis CK) is going for a bike ride around the park with his owner Katie (voice of Ellie Kemper). Max tells us how Katie found him when he was a puppy, and since then, he's had it good.  After Katie leaves for work, Max just sits at the door and waits for her to come home. We meet the other pets that live near Max, including Gidget (voice of Jenny Slate), Chloe (voice of Lake Bell), Mel (voice of Bobby Moynihan), Buddy (voice of Hannibal Buress), and Sweet Pea (voice of Tara Strong). Gidget has a crush on Max, which he is unaware of. Chloe is a fat cat that eats her owner's food instead of her own. Sweet Pea is a little bird that turns on the fan and pretends to fly with jets on TV. We also see Leonard the poodle being left with classic music, but he switches it to a System of a Down song when his owner leaves. Max is visited by Chloe, Buddy, and Mel, along with a lost guinea pig named Norman (voice of Chris Renaud).  That night, to Max's horror, Katie brings home a bigger dog named Duke (voice of Eric Stonestreet). Max quickly makes it clear to both Duke and Katie how he feels about Duke being there, but Katie hopes it'll work out between the two of them. Duke overhears Max barking to Katie after Duke tries to sleep in the same bed as Max. Hurt, Duke says he'll do whatever it takes to ensure he stays in this home. He forces Max to sleep on the floor.  The next morning, the dogs are left alone after Katie goes to work. Duke eats food from both his bowl and Max's. Duke then runs toward the wall and knocks over a vase. Max takes the opportunity to make a big mess and have Duke blamed for it so Katie can get rid of him.  Max and Duke get taken out by a dog walker along with Mel and Buddy. When they are unleashed at the park, Duke calls Max over to a hidden area and then drags him away from the park with no one noticing. They end up in an alley where dozens of cats led by the hairless Ozone (voice of Steve Coogan) antagonize them. They take the dogs' collars from them. Duke runs away and leaves Max behind, only to come back when animal control officers chase after them. Max and Duke get captured.  Gidget peeks out her window and sees Mel and Buddy, but no Max. She watches a Spanish soap opera and is inspired to go after her one true love. She runs to the rooftop and finds a hawk named Tiberius (voice of Albert Brooks) in his coop. He tries to eat Gidget at first, but then realizes that's a bad thing. She asks for his help in finding Max so that she can be his best friend. Tiberius flies away immediately.  Emerging from the sewers is an adorable bunny named Snowball (voice of Kevin Hart). The animal control officers stop the truck, and one walks over to him. Snowball goes wild and beats the man up while his two lackeys, a lizard and a tattooed pig named...Tattoo (voice of Michael Beattie), attack the other officer. They hijack the truck and ride away. Snowball makes a key out of a carrot and breaks out one dog named Ripper. The truck crashes against a wall. The animals are about to leave Max and Duke behind until they beg to be saved. Snowball says they are part of the Flushed Pets, as they were abandoned by their owners, and he won't save Max and Duke because he knows they're domesticated. The dogs lie about killing their owner to get on Snowball's good side, and he frees them before the truck explodes. Max and Duke follow him into the sewer.  Tiberius flies up to the roof with Ozone. He coughs up Max's collar in front of Gidget, but he won't say anything else. Gidget starts slapping Ozone until he admits that he knows Max and Duke are in the sewers. Gidget recruits Mel, Buddy, Chloe, Sweet Pea, and Norman to help find the dogs. Although hesitant at first, Chloe convinces the others to help since Max has helped them out before.  Max and Duke are brought into the lair of the Flushed Pets. All of them hate humans for abandoning them, and they plan to wage war against them. Snowball asks the dogs to tell everyone the story of how they killed their owner. Max and Duke make up that they killed her with a blender, which delights Snowball. He brings them to be initiated by getting bitten by a one-fanged viper. Max is the first to go until the alley cats come in and reveal to the Flushed Pets that they just took Max and Duke's collars earlier. The animals sic the viper on the dogs, but they lead the viper to wrap itself around a pipe that causes the brick ceiling to break off and crush it. The dogs escape and are flushed out into the river outside the city. They hop on a ferry that takes them to Brooklyn. Snowball vows to find them and get his revenge.  Buddy brings the pets to the home of an elderly dog named Pops (voice of Dana Carvey). Pops has all the pets in the neighborhood over since his owner is rarely around, and Pops knows all the pets in the city. He guides the pets to the roof in his own way toward the sewers. Once they get there, they find the Flushed Pets with Snowball plotting revenge. When both groups learn that they know Max and Duke, the Flushed Pets chase after the house pets. Norman ends up getting captured by a crocodile and is left behind (though he's not too worried about it).  Max and Duke make it to Brooklyn, and they are both hungry. Duke sniffs out a sausage factory. The two run in and feast on all the sausages they can find, leading to a weird sequence where they imagine the sausages singing We Go Together from Grease. Afterward, the dogs start to warm up to each other. Duke then talks about his previous owner, an older man named Fred. Fred had Duke since he was a puppy, but Duke ended up running away and was captured by Animal Control until Katie found him. Max decides to go look for Fred to bring Duke home.  The dogs find Duke's old home, but they come across a cat telling them to leave. Duke asks about Fred, and the cat says that Fred has died. The family that now lives in the house comes home, and Duke starts barking at them. He gets mad at Max for bringing him there since he knows Max was always trying to get rid of him. Almost immediately, the Animal Control officers show up and take Duke, who lets Max run away. Max instead chases after the truck.  While Max goes to save Duke, Snowball comes out of the sewers with Tattoo and the lizard. They spot Max and chase after him, but Tattoo and the lizard get taken. Max and Snowball decide to team up and chase after the truck. They hijack a bus and follow the truck to the Brooklyn Bridge. The bus falls and causes a traffic jam while the truck swerves off the bridge and gets stuck. The Flushed Pets surround the bridge as they find Max pulling Snowball out of the bus, thinking he killed Snowball. Before the Flushed Pets can get Max, the house pets arrive with Gidget riding Tiberius. She proceeds to pound ALL the Flushed Pets by herself, which impresses Max. Max rushes to save Duke, but the truck falls into the river with both dogs in it as Max tries to get the keys. Snowball then plunges into the river and gets the keys back to Max so he can get Duke out, and they all swim to the surface.  Tattoo steals a taxi and drives the pets back home. Max tells Gidget how he started to feel after seeing her fight the other animals, and she excitedly starts licking him. The Flushed Pets are about to return to the sewers until a little girl sees Snowball and adopts him, making him happy once again. The other pets return to their owners right before they all get home. Katie comes home and see Max and Duke waiting for her together. She is happy to see the two of them getting along. The three of them then go out onto the fire escape to see the city at night. Max and Duke have now become good friends.  During the credits, Mel and Buddy go to a party at the home of Leonard, with Snowball in attendance. Leonard's owner comes home, forcing the animals to scatter. When the owner asks Leonard if he was a good boy, Tattoo falls from the ceiling on a chandelier."
    },
    "cloverfield_lane": {
      "name": "10 Cloverfield Lane",
      "link": "http://www.imdb.com/title/tt1179933/",
      "content":"In the opening scene, a woman named Michelle (Mary Elizabeth Winstead) is looking outside her window. She's on the phone with someone, arguing. Michelle then packs a bunch of her belongings and leaves her home.  Michelle drives far from the city down to the rural area. Her fiance Ben (voice of Bradley Cooper) calls her. She answers but only lets him talk and say how sorry he is, and that she shouldn't leave him just like that. Michelle hangs up. Ben calls again, and Michelle takes her eyes off the road for a second when her car gets slammed by a truck, causing her to roll into a ditch.  Michelle wakes up with a head wound in a small room with a needle in her arm that's hooked to a saline drip. To her horror, she sees her leg is chained to a pipe. She grabs her saline drip pole and pulls her phone toward her to call for help. Unfortunately, there is no signal. Someone comes downstairs to open the door to the room. It is a man named Howard (John Goodman). He claims to have rescued Michelle from the car accident and is keeping her alive. Howard offers Michelle a pair of wooden crutches to help her remain mobile with her leg injury sustained from the car crash, and tells her to get good on those before leaving the room.  Michelle sets about carving the tip of one of the crutches to sharpen it into a weapon to attack Howard with. The next time Howard shows up, Michelle tries to stab him with the sharpened crutch unsuccessfully, but Howard quickly grabs her and sedates her.  When she comes to, Howard calmly explains to Michelle that there has been an attack on the surface, and that the air up there is unbreathable, so he brought Michelle down to the bunker beneath his farm. Howard brings Michelle up to the airlock to see what's going on outside. Nothing appears unusual, but Michelle spots Howard's truck with red paint on the side, and she recognizes it as the truck that hit her.  From the bedroom, a clattering sound is heard from outside. Howard goes to yell at someone off-screen. Michelle leaves the room and finds a younger man named Emmett (John Gallagher, Jr.). His arm is broken, and Howard tells Michelle that Emmett knocked over a shelf with a week's worth of food.  Emmett appears more friendly than Howard. He explains that he willingly joined Howard in building the bunker, Emmett claims to have seen the attack occur, describing a red flash and running to get inside, which he says explains his broken arm.  Howard makes Michelle and Emmett join him for dinner like a family. Michelle engages in pleasant conversation with Emmett that appears sort of flirty, causing Howard to angrily respond. He warns the two of them not to behave like that. When he's not looking, Michelle grabs his keys. A rumble occurs overhead, distracting everyone but giving Michelle a chance to smash a beer bottle over Howard's head. She runs out toward the airlock and tries to get out. Michelle stands in the airlock between the outside and the inside as Howard begs her not to go outside. A woman (Suzanne Cryer) pleads to be let inside, but her skin is deformed from an infection. Howard urges Michelle not to let this woman in. The woman grows agitated and starts banging her head on the glass of the door.  Now fearing that Howard may be right, Michelle begins to listen to him. He apologizes for his previous behavior and admits to hitting her car. He then tells Michelle to stitch up the wound on his head from the broken bottle.  Eventually, the trio become friendlier with each other and start working together like a real family. Howard lets Michelle borrow clothes belonging to his daughter Megan, whom he lost. He shows Michelle a picture of Megan. Michelle and Emmett also bond, with Emmett discussing how he had a chance to play sports for a university, but he skipped the chance to leave town because he was afraid. Michelle recounts a time when she saw a little girl being abused by her dad at a hardware store, and she felt bad for walking away and doing nothing, especially considering her own troublesome childhood.  The air filtration system goes down, and only Michelle is small enough to fit through the vents and go to the filtration room. She resets the unit but notices a ladder leading to outside, just beneath a window. On the window is HELP scratched out, with the L and P having traces of blood on it. On the floor, Michelle finds two bloody earrings that she recognizes from the picture of Megan. She shows the picture to Emmett, who says the girl in the picture is really a girl from his high school named Brittany, and she went missing a while back. The two realize that Howard is a threat, and they need to get out of there.  Michelle and Emmett steal Howard's tools and start constructing a makeshift biohazard suit and gas mask. Howard discovers the stolen tools and brings out a vat of perchloric acid to dissolve them. Howard demands to know why they were trying to take his gun. Emmett speaks up and says he did it so that Michelle could respect him the way she respects Howard. Howard forgives Emmett and then shoots him in the head.  Michelle finishes the suit and tries to make her escape. Howard catches her, but she pushes the vat of acid toward him, causing him to slip and fall face-first onto it. She climbs over and heads toward the exit. The acid eats through an electrical wire and starts a fire. Howard follows Michelle and she pushes a shelf on top of him. She climbs through the vents to head to the filtration room. Howard stabs through the vents with a knife. He grabs onto Michelle as she makes it to the end, but she slams his hand hard enough for it to rip off. The fire starts spreading through the bunker. Michelle puts the suit and gas mask on and prepares to head on outside.  Once again, everything is calm. Michelle looks up and sees birds flying overhead. She takes off the mask and breathes in the fresh air. She goes to Howard's truck and then spots what she thinks is a helicopter in the distance. It's really a massive alien hovercraft. The bunker then explodes, attracting the alien spacecraft toward that spot. It begins to spread a toxic green gas, so Michelle quickly puts the mask back on. Michelle runs to the barn and finds the dead body of the infected woman from earlier. Through the cracks, Michelle sees a worm-like creature surrounding the truck. When it's gone, she grabs the cars keys off the woman and runs toward it. The creature chases Michelle, cornering her in the truck. The craft goes near her and picks the truck up, bringing it closer to its mouth. Michelle grabs a magazine, lighter, and whisky bottle to make a Molotov cocktail. She lights it and seizes the opportunity to throw it into the creature's mouth. It drops the truck and then explodes.  Michelle drives away for good. She hits Howard's mailbox, which has the address 10 Cloverfield Lane on it. Michelle turns on the radio and hears that anybody seeking refuge from the alien attacks may head to Baton Rouge, but anybody with combat or medical expertise is needed in Houston. Michelle reaches the sign that directs people straight to Baton Rouge or left to Houston. Michelle makes the choice to go left. As she drives there, a thunderclap shows a bigger alien hovercraft hiding in the clouds."
    },
    "vvintch": {
      "name": "The VVitch",
      "link": "http://www.imdb.com/title/tt4263482/",
      "content":"The film starts with William (Ralph Ineson), the patriarch of a Puritan family, on trial in 1630s New England. He dismisses those around him as false Christians, and the others claim that he speaks ill of the word of God.  In a flashback, William's family includes his wife Katherine (Kate Dickie), eldest daughter Thomasin (Anya Taylor-Joy), son Caleb (Harvey Scrimshaw), twins Mercy (Ellie Grainger) and Jonas (Lucas Dawson), and baby Samuel. They recently moved off their plantation in England to a small farm. Mercy and Jonas frequently play with a large black goat that they named Black Phillip.  One afternoon, Thomasin is outside playing Peek-A-Boo with Sam. She covers her face to scare him, but when she looks down, Sam is gone. We cut to somewhere in the darkest part of the woods where a wrinkled hand strokes Sam's body, moments before the creature lowers a knife to his chest. We then see a haggard old woman pounding what appear to be Sam's remains before consuming them. The woman then slowly walks out into the woods.  Katherine becomes distraught following Sam's disappearance. The family believes that a wolf took the baby. Caleb goes out to hunt with his father, but first he starts to notice Thomasin's breasts. Out in the woods, Caleb becomes fearful that Sam was taken because he lived in sin, making Caleb worry that he is also leading a sinful life that will lead to his doom.  William comforts his son, and they proceed to hunt. William aims his rifle at a rabbit, but the recoil from the shot gets him in the eye, and the rabbit runs away. The two return home to an angry Katherine. Thomasin takes the blame for her father for the two of them going to hunt.  Thomasin and Caleb are by the river gathering water. Mercy comes along and accuses Thomasin of being a witch, blaming her for Sam's disappearance. Thomasin plays along with the accusation and starts to terrify Mercy. Thomasin says she is a witch, and that she will get Mercy if she continues to bother her.  With a lack of growth on their crops beginning to turn problematic, Thomasin and Caleb venture into the woods. The two are separated from each other. Caleb disappears and comes across a small cottage. From the doorway emerges a beautiful woman (Sarah Stephens). She lures Caleb toward him and she kisses him before grabbing his head with a haggard hand.  Thomasin later finds Caleb outside in the rain, naked and scarred. The family becomes worried that something evil is overtaking them. Mercy and Jonas continue to accuse Thomasin of being a witch, to the point where even Katherine appears to believe it. Later, Katherine discusses with William that they should give Thomasin to another family, which she overhears. Caleb is bedridden, and the family prays for him. After a while, Caleb begins to writhe and speak some sort of prayer, while Mercy and Jonas also writhe on the ground as if they were possessed. Caleb speaks as though he accepts that he is about to meet God, and he starts to moan passionately before dying with a smile on his face.  Thomasin runs outside to cry in despair. William starts to accuse her of evildoing that led to Caleb's death. She angrily defends herself and states that perhaps it was Mercy and Jonas that made a demonic pact with Black Phillip. William locks his three surviving children in the barn with the goats until something happens. Inside the house, Katherine tearfully confesses to William that she had an affair from which Samuel was born.  In the barn, the kids see a pale, nude figure drinking the blood of one of the goats. The creature (a witch) turns around and cackles at Mercy and Jonas, causing them to scream. Meanwhile, Katherine appears to find Caleb sitting in a chair, holding Samuel. She approaches them and takes Sam to breastfeed him, but in reality, it is just a crow picking at Katherine's bosom while she laughs gleefully.  In the morning, the goats have been slaughtered, and Mercy and Jonas have vanished. Thomasin emerges from the barn and sees Black Phillip charge at William, impaling him with one of his horns. William grabs a hatchet and seems ready to fight, but he then drops it, allowing Black Phillip to charge at him again and knock him into a pile of logs that crushes him. Katherine comes out and continues to accuse Thomasin, blaming her for the deaths of her family members. Katherine starts to choke Thomasin, who continuously tells her mother that she loves her. Thomasin grabs a nearby blade and hacks at Katherine's face until she is dead.  Thomasin quietly walks into a barn and dons a cloak. She later encounters Black Phillip and demands to speak to him. After a brief moment of silence, we hear the quiet voice of Phillip. He asks Thomasin what it is that she desires, and tells her what he can promise to give her. Phillip appears to take human form and walks behind Thomasin, telling her to undress. She does, and she follows him into the woods while naked. In the middle of the woods is a coven of witches, all dancing nude around a fire. The witches then start to float in the air. Thomasin embraces the darkness and begins to float high above the trees herself."
    },
    "keanu": {
      "name": "Keanu",
      "link": "http://www.imdb.com/title/tt4139124/",
      "content":"Inside King Diaz's Church, people are manufacturing drugs. Two dark and scary looking gunmen enter. These are the Allentown Brothers (Key and Peele in dual roles). They shoot up the place. People die. Bullets fly. A cat runs through all the action narrowly missing injury. Everyone is dead. King Diaz comes out from hiding and the cat runs up to him. Uh-Oh! The Allentown Brothers are still there. Diaz begs them not to hurt his cat. The Brother played by Jordan Peele picks up the cat. They like each other, but that doesn't stop the Brothers from killing Diaz. The cat runs away. The cops show up and we hear gunfire as the cat runs through Los Angeles.  Meanwhile, Clarence (Keegan-Michael Key) drives in his mini-van, jamming to George Michael Faith. He calls his friend Rell (Jordan Peele). Rell just got dumped by his girlfriend. He explains, while hitting his bong, that she said he was a loser. Clarence says hell be right there. They hang up and theres a scratching sound at the door. Rell opens it to find the cat, now completely covered in filth.  Clarence arrives shortly after and assures Rell that everything happens for a reason. Rell, much happier now, agrees and says, I want you to meet Keanu. He presents the now freshly bathed cat.  2 WEEKS LATER  Clarences wife and daughter are headed out for a weekend trip with their friend Spencer (Rob Huebel) and his daughter. Spencers wife got food poisoning and wont be joining them. Spencer rolls up the window as Clarence says goodbye to his wife. As they leave, Clarence considers that for a beat, but decides that its probably nothing.  He heads over to Rell's house to find him making a cat calendar posing Keanu in different movie parody photos. They head out to see a Liam Neeson movie. When they return to Rell's place, they find someone broke in, trashed it and most importantly STOLE KEANU!!!  They call the cops and are told that a lot of times break ins are people either looking for drugs or looking for stuff they can sell for drugs. So Rell decides to check with his dealer to see if he knows anything. His dealer, Hulka (Will Forte) is his next door neighbor. Hulka tells him it sounds like the 17th Street Blips did it. Rell demands to know where the 17th Street Blips hang out. Obviously 17th Street is specifically a topless bar called Hot Party Vixens (HPV for short). The leader of the Blips is a guy named Cheddar (Method Man).  Clarence and Rell go to HPV to look for Cheddar. Rell adopts his street voice and tells Clarence to toughen up too because right now he sounds like Richard Pryor imitating a white guy. One of the strippers takes Clarence's wedding ring. Hi-C (Tiffany Haddish) asks them what they're doing there. They say their names are TekTonic and Sharktank and theyre there to meet Cheddar. She takes them to see him. Cheddar wants to know why hes never seen them before. TekTonic (Peele) says maybe they didn't want to be seen. That immediately makes Cheddar assume theyre the Allentown Brothers. Yep! Tek/Rell agrees that they are. Cheddar heard about the slaughter at King Diazs Church and wants the Allentown Brothers to teach his crew how to get the job done. He also picks up a baseball cap and reveals underneath it is Keanu, dressed in gold chains and a do-ragnow named New Jack. Tek says they'll help Cheddar in exchange for the cat. Cheddar says he aint for sale. Tek tells him that everything has a price. So Cheddar says that if they help his crew deliver some Holy Shit (its like smoking crack with God) hell give TekTonic the cat.  Meanwhile, the Allentown Brothers trace Keanu's dirty paw prints to Rell's house, which leads them to Hulka. Hulka tells them that Rell is with the Blips trying to get the cat back.  Rell convinces Clarence to go along with helping the Blips because he needs the cat, plus itll be just like Clarence's day job. Hell be teaching Team Building exercises. They escort the Blips (Bud, Trunks, Stitches and Hi-C) to the deal. On the way there, the Blips ask them a bunch of questions about the details of the King Diaz Church massacre. They heard that the Allentown boys ran up a wall, flipped in midair and shot people at the same time. Rell tries to talk his way out of demonstrating that, while in the background Clarence runs up a wall and flips. They head to the deal in Clarence's mini-van. The Blips want to know why Clarence drives a weak ass van. Clarence says its because the police don't even look at him in it. Everyone heads to the Hollywood Hills.  At a mansion, TekTonic goes inside to do the deal with Hi-C while SharkTank and the rest of the crew stand watch. Sharktank introduces them to George Michael music and soon enough everyone is singing along. He convinces them that George Michael is hard because he used to roll with a dude named Ridgeley, but when they split up, WHAM, no one ever heard from Ridgeley again!  Inside the mansion.TekTonic and Hi-C are at the home of Anna Farris (herself). She got to do some Holy Shit while she was in Europe and is excited to get her hands on more. She has a couple of friends over and theyre having a big old drug party. Tek and Hi want to collect the money, but Anna tells them to respect the game. She pulls out a sword and makes them play Truth or Dare. Hi-C picks truth and tells a story about a time she cut off a guys dick. Tek picks truth and says he once cut off two dicks. Hi-C picks dare and Anna dares her to shoot Tek. There's a big fight and Hi-C kills Anna Farris and her friends. They take the money and run.  Back at HPV, Clarence (as Sharktank still) is bonding with the rest of the Blips. One of them even gets a George Michael tattoo. Rell (still as TekTonic) and Hi-C bond. She thanks him for helping her kill all those people. He corrects her and says that she killed all those people. He goes in for a kiss, but is denied. Rell just wants to get Keanu and get out of there now that they've done the deal, but Clarence is having fun finally cutting loose. He says that Rell's just jealous that the Blips like him more. To prove hes wrong, Rell smokes some weed with them and offers it to straight laced Clarence. Clarence says he only smokes from pipes. Someone offers him a pipe on the spot. He hits it and offers it to the Blips who say they dont mess with Holy Shit.  Clarence trips hard! He sees himself in the George Michael Faith video, singing and dancing together. Then he sees Keanu talking to him. Keanu (voiced by Keanu Reeves) tells him to be excellent and where he goes is up to him. Clarence says \"that's some Matrix shit\". His ringing phone snaps him back to reality. Its his wife. She tells him that shes coming home early because Spence was being inappropriate. Clarence tells Rell, lets get Keanu and get out of here. They do, but are caught by the real Allentown Brothers.  They're tied up and the Allentown Brothers are going to kill them, but Keanu manages to scratch through the rope and free Rell. Rell frees Clarence and they grab guns. They tell the Allentown Brothers that they're going to shoot them unless they let them take Keanu and go. The Allentown Brothers don't listen. Clarence and Rell shoot the Allentown Brothers. They hit the ground, but a moment later pop back up. More gunfire to the chest and theyre down again.  Clarence and Rell escape, but are caught by Cheddar. They come clean and tell Cheddar what happened. Cheddar tells them that they're going to be his Allentown Niggahs anyway. So they head to Bacon Diaz (Luis Guzmans) estate so Cheddar can collect the bounty. Clarence and Rell insist theyre not really the Allentown Brothers, but when Bacon sees Keanu, he recognizes him as his cousins, King Diaz, cat Iglesias. Bacon wants Iglesias back so his aunt has something to remember his cousin. Cheddar thinks about it for a second, but decides to light this bitch up. There's a huge gunfight. Clarence is pleased because he sees that the Blips did learn some team building techniques and are doing well in the shoot out because they're communicating. Hi-C gets shot and drops the Keanu. Rell chases after him, gets him, does a wall flip and is shot in the leg by Bacon. Clarence gets shot in the hand. Bacon takes the cat and gets in one of his cars. Rell jumps in the front seat and drives off. He tells Clarence hes going to his house. Clarence steals Bacon's sons car and chases after them.  Bacon and Rell car fight. Bacon shoots out the windshield. Rell hits the brakes and Keanu ends up on hood. Bacon is going to kill Rell, but Keanu jumps in and claws Bacons face. Rell smashes the car into the retaining wall in front of Clarence's house. Bacon flies out. Clarence shows up. Bacon gets up, but shows up and kills him. Hi-C turns on Cheddar. Shes an undercover cop with the LAPD. Spencer shows up to drop off Clarence's wife. Clarence punches him out. His wife kisses him and tells him, I want you to fuck me right now! They go inside.  Rell and Hi-C talk. Her real name is Trina Parker. Anna Farris friends were undercover cops too. The police hire celebrities all the time like Steven Seagal and Shaq. Anna Farris was undercover too. The whole thing was faked. She kisses him. He tells her hed like to go someplace. She says, Mm-hm. Jail. But Ill testify on your behalf.  6 Months Later  Clarence and Rell are in jail, but its not that bad. They're heroes because they killed the Allentown Brothers. The rest of the Blips are in jail too.  The credits roll over different movie parody scenes with Keanu.  Post credits: The Allentown Brothers sit up one more time. They're still alive!!!"
    },
    "huntsman": {
      "name": "The Huntsman: Winter's War",
      "link": "http://www.imdb.com/title/tt2381991/",
      "content":"Long before Snow White claimed her rightful place as ruler of her kingdom, there was another story that took place. The evil Queen Ravenna (Charlize Theron) killed her husband and ruled over his kingdom with the power of the Magic Mirror, and her sister Freya (Emily Blunt) by her side. Freya fell in love with the Duke of Blackwood (Colin Morgan), who was already promised to another. Ravenna knows that Freya is carrying his child, which Freya herself did not know.    Freya and the Duke married in secret, and she gave birth to a daughter. However, one night, Freya found her child's crib burnt, and the Duke stood there claiming that he had no choice. Freya screams in sorrow, unleashing her ice powers to turn the Duke into an ice statue that shatters. In her grief, she left the kingdom and went to the north, where her soldiers abducted dozens of children from their homes after killing their parents. Freya took the children in and had them trained as her personal huntsmen. Her only condition was that nobody could ever feel love.  The children spend many years training in combat. The two most exceptional fighters are Eric, the Huntsman (Chris Hemsworth) and Sara, the warrior (Jessica Chastain). They share a forbidden romance that they keep in secret. One night, they go out to a nearby lake and make plans to elope. Sara gives Eric a necklace bearing a medallion.  When the two return to Freya's castle, they are ambushed by a number of huntsmen as Freya has become aware of Eric and Sara's romance. The huntsmen go after the lovers, but they fight them off easily. Freya then creates a massive ice wall to separate Eric and Sara. Eric then sees one huntsman, Tull (Sope Dirisu), stab Sara in the back. She slumps over against the wall, apparently dead. Eric grieves for her.   ? Seven years pass, and Snow White is now queen, while Ravenna has been killed by her. Eric meets with King William (Sam Claflin), and two dwarves, Nion (Nick Frost) and Gryff (Rob Brydon). William says that the Mirror was haunting Snow White, as she heard voices coming from it. Now it has been taken to a sanctuary. Eric travels with Nion and Gryff to retrieve the Mirror. Meanwhile, Freya is watching them through the eyes of an owl using a special mask.  Eric and the dwarves come across the bodies of several soldiers that were killed by their own weapons. Later, they stop in a pub and are confronted by Freya's huntsmen. They recognize Eric and label him a traitor for disobeying Freya's rule. The huntsmen fight him and the dwarves outside, until a hooded fighter enters and defeats the huntsmen. It's Sara.  When Eric wakes up, Sara accuses him of abandoning her all those years ago when Freya put up the wall. As it turns out, Eric seeing Sara being killed and Sara seeing Eric leaving was a trick that Freya conjured to separate the two for good. Despite this, Eric never stopped loving Sara.  Sara now joins the men on the quest for the Mirror. They get ensnared in a trap laid out by two female dwarves, Bromwyn (Sheridan Smith) and Doreena (Alexandra Roach), which is meant for goblins. They join the others on their journey. Nion and Doreena develop an attraction to each other, while Gryff and Bromwyn are at odds with one another.   The group travels through the forest and come across the sanctuary and the Mirror, but they are attacked by large horned goblins. Eric and Sara battle the goblins while the dwarves take the Mirror. Eric appears to be taken by the goblins, to Sara's horror, but he emerges fine.  With the Mirror in hand, the group prepares to head back to the kingdom, but they are cornered in the forest by Freya and her huntsmen. Turns out Sara was sent by Freya to trick Eric into helping her find the Mirror. Freya turns Nion and Doreena into ice statues, and she forces Sara to kill Eric. Sara reluctantly shoots an arrow at Eric's chest. Freya takes Sara and the Mirror back to her kingdom. When they're gone, Gryff and Bromwyn try to pull the arrow out of Eric's chest, only to discover that Sara intentionally shot it at the medallion he kept around his neck (and she never misses).  Gryff and Bromwyn sneak into the kingdom while Eric hops across rooftops to infiltrate Freya's castle. Meanwhile, Freya asks the Magic Mirror who the fairest of them all is, which resurrects Ravenna. She claims that she is not really alive or dead, but somewhere in between.    Freya then gathers all her huntsmen together. Eric makes it to the main room and aims his arrow at Freya. He shoots it, only for it to get caught by Ravenna, to Eric's surprise. Eric calls upon the other huntsmen to stand beside him and end the sisters' corruption. The huntsmen side with him and Sara. Ravenna then uses her dark magic against the huntsmen, to Freya's horror. Freya creates another huge wall of ice to keep them away from her. Eric and Sara start to climb it. Ravenna argues with her sister, eventually revealing that she had asked the Magic Mirror who the fairest in the land was, and the Mirror told her that Freya's daughter would grow to be more beautiful than her. Thus, she cursed the Duke and forced him to kill their baby. Enraged, Freya brings the ice wall down and fights her sister. Ravenna pulls Freya close and impales her. Eric runs to Ravenna and battles her. Freya uses her last bit of ice magic to freeze the Mirror. Eric then hurls a hatchet at it, causing it to shatter and turn Ravenna into a gold statue that crumbles. Eric and Sara come together. Before Freya dies, her last words to them are, How lucky you are.  The ice magic wears off the people that Freya froze, including Nion and Doreena. The people in the kingdom rejoice. Eric and Sara are free to love again, as are Nion and Doreena, as well as Gryff and Bromwyn (who always had a thing for each other). Up above the castle, a golden bird from the Mirror flies overhead, indicating not all of Ravenna is gone."
    },
    "anomalisa": {
      "name": "Anomalisa",
      "link": "http://www.imdb.com/title/tt2401878/",
      "content":"In darkness, we hear different voices talking to each other -- but they're all from the same voice (Tom Noonan). We see an airplane in the clouds and then pull back to reveal we're in another airplane with Michael Stone (voiced by David Thewlis) looking out the window. He is flying in to Cincinnati and reads a letter from a former girlfriend a vision of her appears over the text, yelling the angry letter at him. The plane lands and the man seated next to Michael apologizes for grabbing his hand during the descent it was a reflex because he's a nervous flyer and he's used to having his wife with him. Michael says it's okay. But suggests that the man let go now.  Michael goes through the terminal where all the people sound exactly the same as they talk. He goes outside and asks the cab driver to take him to the Fregoli Hotel downtown (Unrelated note: it's not stated in the film but this is actually the name of a disease in which delusional people think everyone they encounter is the same person in disguise). The cab driver begins a conversation with Michael, asking him if he's British. Michael says, yes. The cab driver tells him he has an ear for accents. Michael tells him he's lived here for a long while. The driver asks,  Cincinnati?  He says, no, he lives in Los Angeles. He meant the States. The cab driver laughs, saying he loves the phrases British people use like  the States  and  shrimp on the barbie.  He repeats that he has an ear for accents. Michael asks if there is a toy store near the hotel and he is told that there is one very close and he can't miss it. He then tells Michael about the things he should do while he's in Cincinnati including visiting the zoo, which has some rare endangered species. He also is adamant he try the Cincinnati chili which is nothing like the chili Michael's had in Los Angeles or London. Michael says he's only there for one day. The man keeps asking him,  What? Can you repeat that?  So he says  I. AM. ONLY. HERE. FOR. THE. DAY.  The cab driver responds with the same broken tone, telling him the zoo won't take up too much of his time -- it's not too big or small, it's zoo-sized. And the chili will only take about an hour.  Michael gets to the Fregoli. As he walks to the reception desk, people begin whispering,  It's Michael Stone  over and over. The man checks him in to a smoking room with a king-sized bed. He asks if he can have a quiet room. The man types on the computer for a long while and says it's been taken care of. A bellhop comes and leads him to the elevator, telling him  After you  and Go ahead even though Michael keeps entering and exiting before he can prompt him. They get to the room and the bellhop points out random things like  This is the bathroom  and gives advice like not to forget his room key when he leaves. He loiters and Michael gives him money for a tip -- the bellhop responds with incredulity as if he hadn't even thought of it. He gives Michael his card and says to call him if there's any trouble. Michael tosses the card, goes to the bathroom. He takes an antidepressant pill. Urinates in the toilet. He turns on the television, which turns to a hotel channel explaining what to do in case of a fire -- first feel the door for heat and then fill the bathtub with water. He looks down at the magazines by the phone -- one is a local magazine with a story encouraging visitors to  TRY THE CHILI.  He wants to call for room service but there are tons and tons of buttons with pictures of food on them. He finally presses one and the voice on the other line (once again, the same voice as all the other characters) says,  Hello, Michael Stone. Would you like room service?  Michael orders a salad and an entree. The man on the phone asks if he wants to add alcohol but Michael says he'll get something from the mini bar. The voice repeats the order back in elaborate detail, naming each item in each dish. He says it's 9:13 and it will arrive in about 35 minutes, which would be 9:48. Michael hangs up. He then uses his cell phone to call his wife -- who has the same voice as the taxi driver, the receptionist, the bellhop, the room service operator. She asks him about his room and he says it's nothing special but positively notes that it has a big bed. She tells him thats good for him because of all the tossing and turning he does. He says it's thrashing because of his sleeping problems. She then says she's going to put their son on the phone even though Michael insists not to -- his wife is too busy talking to their son to hear him. The son comes on, sounding exactly like the wife (a male voice), and he says he's dressed as a pirate and asks his dad if he's going to bring him a present. The conversation is short and the boy says goodbye.  Michael lights a cigarette and begins practicing his speech for the event the next day. He looks out the window. A man is watching porn, alone in a neighboring office building, and begins to masturbate. He looks up at Michael who has to step behind the curtain to prevent further awkwardness. Michael goes out in the hall, gets ice from the ice machine. A couple is fighting in the hallway but both the man and the woman sound identical. Michael goes back into his room and turns on the TV flips from the channel advising how to handle a fire in the hotel. Watches a scene from  My Man Godfrey. Michael pours himself a drink from the mini bar. He opens the phone book and finds Bella Amarossi He calls her. The same male voice we've heard answers. He asks if Bella is there. She says this is him and asks who he is. He says, sorry, she doesn't sound like he remembered. He says it's Michael Stone -- they haven't seen each other in 10 years. She points out that it's been 11. He tells her he's in town and decided to look her up in the phone book. Tells her he now has a wife and a son and asks if shes also remarried -- she abruptly says, no. He tells her he's there for a conference and staying at the Fregoli. She points out this is a fancy, expensive hotel. He suggests they meet. She tells him she has gained some weight and doesn't want him to be surprised. He says he doesn't care. She then points out that she also had her front tooth replaced after she fell and hit a cement bench but he probably won't be able to tell because they did a good job blending it.  Michael goes down to the lounge. He sees an attractive, full-figured woman enter. But she meets someone else. Then another attractive, full-figured lady enters with an out of shape woman. The out of shape woman approaches, asking  Michael?  They sit and talk with Michael ordering the specific drink he always gets. She is still bitter about him walking out on her 11 years earlier. He suggests going up to his room. She gets angry at him and leaves.  Michael goes to the toy store by the hotel. He talks to the clerk and there is a giant dildo on the counter. He realizes the taxi driver told him about a store that sold the wrong kind of toys. He asks the man if there's anything that he could get his son, who is a pirate. The clerk doesn't have any suggestions. Michael takes note of a large sex toy behind the clerk's head of a Japanese woman's upper torso -- one half of her body is  flesh  and the other is exposed framing. It is an mechanized doll with a moving mouth. Michael is told it's a very popular item, from Japan.  Michael goes upstairs and takes a shower -- at first getting mad at the shower for being too hot, then for being too cold. While he's drying off, he begins to wash his face and hears a FEMALE VOICE (Jennifer Jason Leigh) in the hallway. He freaks out, struggling to put on his pants. He goes in the hallway but it's now empty. He knocks on doors hoping to find the woman, telling other hotel attendants, with the same voice he always hears, that he's looking for a friend and doesn't remember his room number. He knocks on a door and a voluptuous blond woman answers, seductively. She then apologizes and says he isn't who she was expecting. He says he was looking for a friend but he guess she's not there. She then recognizes him as Michael Stone and says he's the reason they're in town -- to go to his conference the next day. Then her friend, Lisa, is revealed in the bathroom excited because shes a huge fan of Michael. When she speaks, its the same female voice he heard. She comes out of the bathroom and gushes over him, telling him she loves his book, which she holds up (It is titled  How May I Help You Help Them? , revealed to be a self-help book for businesses). She tells him they both are customer service representatives and their business used their book and now productivity is up 70 percent. She is very awkward and tells him she doesn't have makeup on and for him not to look at her. Despite her insecurities, he is charmed by her and tells her she has a great voice. She is taken aback by the compliment and figures that's why she must do well in phone sales. He invites the two women downstairs to have a drink with him.  They go to the hotel bar and he orders the same drink as before; they get apple mojitos. Lisa continues being awkward, telling him about the different items that the baked goods company they work for makes (junk food akin to Oreos and Cheetos). She says that she plays the Jew's harp a little but doesn't want to say  Jew's harp  loudly in case she offends Jews. She badly sings along to the music playing overhead. She tells them that they came from Ohio just to see him speak and that they splurged on the fancy hotel because it's sort of a vacation even though she actually can't afford it.  They go back in the elevator, all now buzzed. Lisa complains that she didn't get to press the button to their floor and that she loves pressing buttons and that must be weird, being a button presser lover. When they're headed back to their room, Michael asks Lisa to come back to his. Lisa is surprised, saying that men usually are interested in Emily, not her. He says Emily is lovely but he seems to have connected with her. Emily encourages her to go back to his room because he's  gorgeous.  As she walks, she actually falls flat on her face. She is embarrassed but has such low self-esteem, its not out of character.  They go back to his room and it takes four tries with the key card until the light finally turns green instead of red. Lisa says its really cute how Michael turned down his covers and put slippers on the floor. He points out this is turndown service and she admits to never having stayed at a fancy hotel before. Michael sits on the bed and Lisa takes a seat across from him, in the chair at the desk. She doesn't understand why he likes her because usually Emily gets all the attention when they go out -- she hasn't dated someone in eight years and that guy was a man in his 60s who had a daughter older than her. And he pursued her simply because he figured she wouldn't say no and he was right. She tells him she's not very smart and didn't go to college, didn't even graduate high school. When she read his book, she had to use a dictionary to look up all the words she didn't know. He likes that she read his book with a dictionary. He asks her more about herself and she mentions liking music, with her favorite being Cyndi Lauper. He asks her to sing something. She says she can't sing -- well, she can sing, everyone can sing, but she can't sing well. He prompts her anyway to sing. She nervously begins to sing an a cappella version of  Girls Just Want to Have Fun.  After hearing so many people with the same voice, Michael is touched hearing her voice as she sings. He begins to tear up and she tells her it was beautiful but she interrupts by singing the male refrain of  Girls, they wanna-- they wanna have fun. Girls. They wannathey wanna have fun.  She tells him she relates to that song because she also just wants to walk in the sun. She asks him why that song made him cry; he says he loves her voice so much. She brushes her hair back and accidentally reveals a large scar above her right eye -- it's been hidden because she has always kept a strand of hair over it. He asks how it happened and she says she doesn't want to talk about it. He asks if he can kiss her there. She rambles on about how weird it is that he wants to kiss her there. He tells her he likes her and tries to relax her by asking about her day. They lay back on the bed and he kisses her repeatedly on her face while she tells him a long story about how Emily and her got up early in Ohio, drove to Starbucks, she got a grande mocha Frappuccino while Emily got a chai latte. The drive would only take about four hours if they drove at 60 miles an hour, with bathroom breaks. They would just stay on the 71 almost the whole time because the hotel is right off the freeway. They played No Doubt in the car because Emily likes them. She brought a Sarah Brightman CD and she has a beautiful rendition of  Girls Just Want to Have Fun  in Italian. Michael asks her to sing a little and she does. She explains she loves learning other languages -- Italian, Japanese of course, but not German because it sounds so angry. She wants to learn Portuguese and finds it fascinating that Brazil is the only country in all of South America where they speak Portuguese. All the while he kisses her, takes off her shirt so she's just in her bra. She says she used to hate being different but now she kind of likes it. It makes her unique, an anomaly -- that's a word she learned from his book. He says, she's Anomalisa. She likes that. He puts his hand on her skirt and she squirms. She says she's ticklish down there but it's okay, he can touch her. She even moves his hand down there to show him. He then moves down and slides her panties off, performs oral sex on her. She stays silent. He asks why she's not having a reaction, if she doesn't like it. She says she does but maybe he can be gentler. He is. When she's aroused, she asks him to come up there. They begin to have sex. He asks her if she talks during sex. She says she doesn't know, it's been at least eight years. He asks if she can talk (her voice is the first female one he's heard in years) and suggests she makes moaning sounds. She does and they have a short intercourse session. They go to sleep.  Michael and Lisa are woken up in the middle of the night by a call from the hotel manager; he tells Michael he needs to speak with him about a sensitive manner in private, that he needs to visit him in his office down in the basement. Michael goes down there and finds himself in a small office with dozens of employees typing at computers. They tell them the hotel manager is waiting for him and to go inside. Michael walks into a large warehouse-like room. The manager is at the far end, behind a desk -- he says that he had the option of a 3000 square foot office upstairs or this massive one so, of course, he chose the basement. Michael walks towards him but the manager insists Michael use the golf cart parked by the door. Michael drives it all around for a long while, finally driving it up the ramp. The manager sits at a desk in front of a framed picture of then president George W. Bush. Michael complains about being woken up, saying he has a speech to give. The manager says he knows, he has read Michael's book and the hotel's productivity has gone up 90 percent. He tells Michael he was informed that Michael was having relations in his room that night. Michael asks if that's a crime and the hotel manager laughs and says philandering is not uncommon in the hotel. He just says that it can be anyone but Lisa. The manager suggests if Michael wants to fuck someone, it should be him. Michael is freaked out and tries to get away in the golf cart but it just falls down a pit at the lip of the stage. He runs away back, into the reception area where all the receptionists are now ordinary-looking woman. The manager tells Michael that he can be with any of them, just not Lisa. One woman offers, in Tom Noonans voice, to let Michael fuck her. Michael runs up to his room, screaming. The bottom half of his face falls off (the joints of the puppets have been distinct throughout the entire film instead of being removed in post-production). He picks it up, puts it back on his face. He sees Lisa in the hall. He runs back to his room but she falls on her face. He gets to the room, tries four times to get his hotel key card to work. In the room, he sees a billboard outside the window for the Cincinnati Zoo with the description  It's zoo-sized.   Michael wakes up. Lisa tells him he was thrashing around in his sleep and even hit her in the face with his elbow, which she didn't mind. Michael apologizes, says he is known for doing this in his sleep. Michael asks her if she wants him to order room service. She asks if she can get scrambled eggs. At the table in the room, Lisa and Michael eat breakfast. Lisa asks what happens with them now; she knows he has a wife and son. He says he doesn't really because they don't exist because they're all the same person -- everyone is the same person except for her. He asks if Lisa would be willing to move to Los Angeles. She says, yes. As they eat, Michael notices she is letting her fork scrape against her teeth. He finally interrupts her, tells her to stop doing that. She apologizes, says people always tell her she's a pig when she eats. She continues eating and suggests going to the zoo after his conference. Michael gets distracted by her obnoxiously chewing with her mouth open. He asks her to stop. She then chews for a long while before she finishes her thought. Lisa continues about how the zoo has endangered species including polar bears, which aren't actually bears. As she drones on about trivial things, her voice begins to overlap with Tom Noonan's (who voices all the other characters). By the end of the meal, her voice is now entirely his.  Michael gives his speech to the crowd at the conference but he is mentally gone. He rambles on drunkenly, having a psychotic breakdown, murmuring how he doesn't love her anymore -- amidst giving tips from his book like how the key to good customer service is by remembering every person you meet has their own life, has their own childhood, should be treated like a friend, you should always talk with a smile even on the phone because people can tell. This is all ironic because Michael considers everybody as having the same voice thus the same identity (even though they all physically look different). He begins to mock their president (George W. Bush) for sending them to war, which upsets some of the crowd. He looks up at the lights. Begins to sweat. The speech goes horribly. Lisa is in the audience, mortified every time he mumbles about losing his feelings for his new love.  Michael returns home to his wife, who is voiced by Tom Noonan, as is their son who comes in asking for a present. Michael gives him the Japanese automaton with a moving mouthpiece that he got from the sex toy shop. The boy complains about it being a doll for girls. Michael's wife then points out it looks like semen is coming out of the mouth (we don't see this happening) and her son asks what semen is to which she replies  It's just a liquid.  As they are arguing, dozens of people pop out of the living room for a surprise party. Michael asks who all these people are. His wife tells him they're all of his friends. He says he doesn't know any of them. The festivities continue and everyone speaks in the same voice. Michael's psyche grows crazy until the only sound he can hear is the Japanese female automaton singing a song in Japanese.  Lisa rides in a car that Emily is driving. She writes a letter to Michael, which we hear in voice-over her female voice again. She says she really enjoyed the short experience they had together and she understands that it was only temporary and is now over. She also said she looked up  anomalisa  in her Japanese-American dictionary and found out it means goddess of the sun. She hurriedly notes that she's not suggesting she is one though."
    },
    "against_the_ropes": {
      "name": "Against the Ropes",
      "link": "http://www.imdb.com/title/tt0312329/",
      "content":"Meg Ryan stars in a true story about Jackie Kallen, the first female boxing manager who successfully broke the gender barrier of the boxing world. The film focuses on the relationship she has with her first boxer, Luther Shaw (Omar Epps) and his successful rise to the boxing championship and the inside dealings of the boxing game. Jackie turns Luther into a prizefighter with the help of trainer Felix Reynolds (Charles Dutton). During the press conference after each boxing win, Jackie is put in the spotlight and she lets fame go to her head. Jackie begins to believe that she is the one who made the boxer what he is today, and that she is doing all the work. This causes trouble between Jackie and the boxer. The boxer wants and gets a new manager. Douglas Young (the-movie-guy)"
    },
    "mighty_heart": {
      "name": "A Mighty Heart",
      "link": "http://www.imdb.com/title/tt0829459/",
      "content":"Daniel Pearl was born of Jewish parents. His grandfather has a street named after him in Israel (Chaim Pearl St.). He fell in love with a Cuban-American, Marianne, and got married. One the places they chose for their honeymoon was Mumbai, India. Both worked as journalists with the Wall Street Journal. They were among the thousands of reporters who headed to Afghanistan after September 11, 2001. After spending considerable time there, with Marianne visibly pregnant, they went to Pakistan, the country that on one hand was allied with the U.S. for its war against terrorism, and on the other hand was responsible for the creation of Taliban and hosting training camps for Al Qaeda. The two hook up with fellow journalist Asra Nomani of Indian descent. When Daniel goes off to interview Sheikh Gilani and does not return nor answer his cell phone, a frantic Marianne asks for assistance, which comes initially from Pakistan's CID Chief Javed Habib, then the FBI and American embassy personnel. What results is media frenzy, the locals blaming the Mosaad for the September 11 attacks, as nearly 4000 Jews did not show up for work that day; that Daniel was CIA/Mosaad Agent, and that Asra was an Indian spy. The Pakistani Interior Minister went on record to criticize Daniel for probing into unknown territory, not keeping his Jewish background secret, and blaming his disappearance on Indian spies, while the western media quickly announced his death even though the deceased was an Iranian student. Watch what happens when investigations lead to the discovery of a camcorder which may provide the last and perhaps the only clue to the whereabouts of this missing journalist."
    },
    "american_splendor": {
      "name": "American Splendor",
      "link": "http://www.imdb.com/title/tt0305206/",
      "content":"Harvey Pekar is file clerk at the local VA hospital. His interactions with his co-workers offer some relief from the monotony, and their discussions encompass everything from music to the decline of American culture to new flavors of jellybeans and life itself. At home, Harvey fills his days with reading, writing and listening to jazz. His apartment is filled with thousands of books and LPs, and he regularly scours Cleveland's thrift stores and garage sales for more, savoring the rare joy of a 25-cent find. It is at one of these junk sales that Harvey meets Robert Crumb, a greeting card artist and music enthusiast. When, years later, Crumb finds international success for his underground comics, the idea that comic books can be a valid art form for adults inspires Harvey to write his own brand of comic book. An admirer of naturalist writers like Theodore Dreiser, Harvey makes his American Splendor a truthful, unsentimental record of his working-class life, a warts-and-all self portrait. First published in 1976, the comic earns Harvey cult fame throughout the 1980s and eventually leads him to the sardonic Joyce Barber, a partner in a Delaware comic book store who end ups being Harvey's true soul mate as they experience the bizarre byproducts of Harvey's cult celebrity stature."
    }
  }
}